###########################################################################
#
# Generated by : Version 10.0 Build 218 06/27/2010 SJ Web Edition
#
# Project      : v1495usr_scaler
# Revision     : v1495usr_scaler
#
# Date         : Fri Jul 08 17:46:13 EDT 2022
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: LOCAL_CLOCK
create_clock -period "20.000 ns" \
             -name {LCLK} {LCLK}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----
# QSF: -name CUT ON -from coin_unit:I0|MODE -to *
set_false_path -from [get_keepers {coin_unit:I0|MODE}] -to [get_keepers *]
# QSF: -name CUT ON -from coin_unit:I0|A_EN_MASK -to *
set_false_path -from [get_keepers {coin_unit:I0|A_EN_MASK}] -to [get_keepers *]
# QSF: -name CUT ON -from coin_unit:I0|B_EN_MASK -to *
set_false_path -from [get_keepers {coin_unit:I0|B_EN_MASK}] -to [get_keepers *]
# QSF: -name CUT ON -from coin_unit:I0|C_EN_MASK -to *
set_false_path -from [get_keepers {coin_unit:I0|C_EN_MASK}] -to [get_keepers *]

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------


# ** Tco/MinTco requirements
#    -----------------------
# --------------
# Represent unkown external clock as N/C (Not a Clock)
create_clock -name "N/C" -period 10.0
# --------------
# QSF: -name TCO_REQUIREMENT 10 ns -from LCLK -to LAD
set_output_delay 0.0 -clock "N/C" [get_ports {LAD[*]}]
set_max_delay 10 -from [get_clocks {LCLK}] -to [get_ports {LAD[*]}]

#
# Entity Specific Timing Assignments found in
# the Timing Analyzer Settings report panel
#


# ---------------------------------------------

